html/Blog/About/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta http-equiv="X-UA-Compatible" content="ie=edge">
<title>Blah</title>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.1.2/css/all.min.css" integrity="sha512-1sCRPdkRXhBV2PBLUdRb4tMg1w2YPf37qatUFeS7zlBy7jJI8Lf4VHwWfZZfpXtYSLy85pkm9GaYVYMfw5BC1A==" crossorigin="anonymous" referrerpolicy="no-referrer">
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css">
</head>
<body>
<div id="preamble" class="status">
<header> <a href="https://ianstranathan.github.io/">Main</a> :: <a href="https://ianstranathan.github.io/Blog/">Blog</a> ::</header></header>
</div>
<div id="content" class="content">
<div id="outline-container-orgbb0c8d7" class="outline-2">
<h2 id="orgbb0c8d7">Mostly this:</h2>
<div class="outline-text-2" id="text-orgbb0c8d7">
<p>
<a href="https://t3x.org/whoami.html">Nils Holm's about page</a>
</p>
</div>
</div>

<div id="outline-container-org46fc301" class="outline-2">
<h2 id="org46fc301">Misc resume stuff</h2>
<div class="outline-text-2" id="text-org46fc301">
</div>
<div id="outline-container-org1e755f3" class="outline-3">
<h3 id="org1e755f3">Education</h3>
<div class="outline-text-3" id="text-org1e755f3">
<ul class="org-ul">
<li>B.S. Physics     (University of Vermont, VT. USA)</li>
<li>B.S. Mathematics (University of Vermont, VT. USA)</li>
<li>Almost B.S. Mechanical Engineering (University of Akron, OH. USA).</li>
</ul>
</div>
</div>

<div id="outline-container-org7ea1f26" class="outline-3">
<h3 id="org7ea1f26">Skills</h3>
<div class="outline-text-3" id="text-org7ea1f26">
<ul class="org-ul">
<li>Programming
<ul class="org-ul">
<li>Graphics programming: WebGPU, WebGL, OpenGL, GLSL,
<ul class="org-ul">
<li>currently learning or playing around with GPGPU</li>
</ul></li>
<li>Languages:
<ul class="org-ul">
<li><span class="underline">use more often or just enough to have fun</span>: Python, Lisp (Common Lisp, Emacs Lisp), JavaScript, C, C++</li>
<li><span class="underline">currently learning or playing around with</span>: Clojure, Haskell</li>
<li><span class="underline">have been exposed to or used at some point previously and have no interest in</span>: Java, C#</li>
</ul></li>
</ul></li>
<li>Math
<ul class="org-ul">
<li>Vector Analysis &amp; Geometric Algebra/ Calculus for my graphics stuff</li>
<li>currently learning or playing around with: Tensor Calculus</li>
</ul></li>
<li>Modeling &amp; Simulation</li>
<li>Data Analysis</li>
<li>Foreign Languages:
<ul class="org-ul">
<li>German  (C1)</li>
<li>Turkish (B2)</li>
<li>Spanish (A2)</li>
<li>Italian (A2)</li>
<li><a href="https://www.duolingo.com/profile/ThisDewDropWorld">Long term Duolingo user</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb3f44bf" class="outline-3">
<h3 id="orgb3f44bf">Hobbies</h3>
<div class="outline-text-3" id="text-orgb3f44bf">
<ul class="org-ul">
<li>Fitness:
Calisthenics and weightlifting with the occasional distance challenge
(have completed one marathon and one 24-hour run)</li>
<li>Sustainability: sustainable architecture, permaculture, passive energy systems.</li>
<li>Demoscene/ Shadertoy</li>
<li>Game Development: I've spent a good amount of time developing various indie games. I've yet to release anything unfortunately.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer><p>©Ian Stranathan <script>document.write(new Date().getFullYear())</script></p></footer>
</div>
</body>
</html>